```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.closure_expiration_event_lambda.github_actions_secret.repository_secret["MANAGEMENT_ACCOUNT"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dp-closure-expiration-event-generation"
      + secret_name     = "MANAGEMENT_ACCOUNT"
      + updated_at      = (known after apply)
    }

  # module.closure_expiration_event_lambda.github_actions_secret.repository_secret["SLACK_WEBHOOK"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dp-closure-expiration-event-generation"
      + secret_name     = "SLACK_WEBHOOK"
      + updated_at      = (known after apply)
    }

  # module.dr2_github_actions_scala_steward.github_actions_secret.repository_secret["GPG_KEY_ID"] will be destroyed
  # (because github_actions_secret.repository_secret is not in configuration)
  - resource "github_actions_secret" "repository_secret" {
      - created_at      = "2023-08-16 11:40:25 +0000 UTC" -> null
      - id              = "dr2-github-actions:GPG_KEY_ID" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "dr2-github-actions" -> null
      - secret_name     = "GPG_KEY_ID" -> null
      - updated_at      = "2023-08-16 11:40:25 +0000 UTC" -> null
    }

  # module.dr2_github_actions_scala_steward.github_actions_secret.repository_secret["GPG_PASSPHRASE"] will be destroyed
  # (because github_actions_secret.repository_secret is not in configuration)
  - resource "github_actions_secret" "repository_secret" {
      - created_at      = "2023-08-16 11:40:29 +0000 UTC" -> null
      - id              = "dr2-github-actions:GPG_PASSPHRASE" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "dr2-github-actions" -> null
      - secret_name     = "GPG_PASSPHRASE" -> null
      - updated_at      = "2023-08-16 11:40:29 +0000 UTC" -> null
    }

  # module.dr2_github_actions_scala_steward.github_actions_secret.repository_secret["GPG_PRIVATE_KEY"] will be destroyed
  # (because github_actions_secret.repository_secret is not in configuration)
  - resource "github_actions_secret" "repository_secret" {
      - created_at      = "2023-08-16 11:40:28 +0000 UTC" -> null
      - id              = "dr2-github-actions:GPG_PRIVATE_KEY" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "dr2-github-actions" -> null
      - secret_name     = "GPG_PRIVATE_KEY" -> null
      - updated_at      = "2023-08-16 11:40:28 +0000 UTC" -> null
    }

  # module.dr2_github_actions_scala_steward.github_actions_secret.repository_secret["WORKFLOW_TOKEN"] will be destroyed
  # (because github_actions_secret.repository_secret is not in configuration)
  - resource "github_actions_secret" "repository_secret" {
      - created_at      = "2023-08-16 11:40:30 +0000 UTC" -> null
      - id              = "dr2-github-actions:WORKFLOW_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "dr2-github-actions" -> null
      - secret_name     = "WORKFLOW_TOKEN" -> null
      - updated_at      = "2023-08-16 11:40:30 +0000 UTC" -> null
    }

  # module.github_preservica_client_repository.github_actions_secret.repository_secret["GPG_PASSPHRASE"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-preservica-client"
      + secret_name     = "GPG_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # module.github_preservica_client_repository.github_actions_secret.repository_secret["GPG_PRIVATE_KEY"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-preservica-client"
      + secret_name     = "GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # module.github_preservica_client_repository.github_actions_secret.repository_secret["SLACK_WEBHOOK"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-preservica-client"
      + secret_name     = "SLACK_WEBHOOK"
      + updated_at      = (known after apply)
    }

  # module.github_preservica_client_repository.github_actions_secret.repository_secret["SONATYPE_PASSWORD"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-preservica-client"
      + secret_name     = "SONATYPE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # module.github_preservica_client_repository.github_actions_secret.repository_secret["SONATYPE_USERNAME"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-preservica-client"
      + secret_name     = "SONATYPE_USERNAME"
      + updated_at      = (known after apply)
    }

  # module.github_preservica_client_repository.github_actions_secret.repository_secret["WORKFLOW_TOKEN"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-preservica-client"
      + secret_name     = "WORKFLOW_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.github_preservica_config_repository.github_actions_secret.repository_secret["MANAGEMENT_ACCOUNT"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-preservica-config"
      + secret_name     = "MANAGEMENT_ACCOUNT"
      + updated_at      = (known after apply)
    }

  # module.github_preservica_config_repository.github_actions_secret.repository_secret["SLACK_WEBHOOK"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-preservica-config"
      + secret_name     = "SLACK_WEBHOOK"
      + updated_at      = (known after apply)
    }

  # module.ingest_mapper_environments["intg"].github_actions_environment_secret.secret["ACCOUNT_NUMBER"] will be created
  + resource "github_actions_environment_secret" "secret" {
      + created_at      = (known after apply)
      + environment     = "intg"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-ingest-mapper"
      + secret_name     = "ACCOUNT_NUMBER"
      + updated_at      = (known after apply)
    }

  # module.ingest_mapper_environments["intg"].github_repository_environment.environment will be created
  + resource "github_repository_environment" "environment" {
      + environment = "intg"
      + id          = (known after apply)
      + repository  = "dr2-ingest-mapper"

      + reviewers {}
    }

  # module.ingest_mapper_environments["mgmt"].github_actions_environment_secret.secret["ACCOUNT_NUMBER"] will be created
  + resource "github_actions_environment_secret" "secret" {
      + created_at      = (known after apply)
      + environment     = "mgmt"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-ingest-mapper"
      + secret_name     = "ACCOUNT_NUMBER"
      + updated_at      = (known after apply)
    }

  # module.ingest_mapper_environments["mgmt"].github_repository_environment.environment will be created
  + resource "github_repository_environment" "environment" {
      + environment = "mgmt"
      + id          = (known after apply)
      + repository  = "dr2-ingest-mapper"

      + reviewers {
          + teams = [
              + 7929871,
            ]
        }
    }

  # module.ingest_mapper_environments["prod"].github_actions_environment_secret.secret["ACCOUNT_NUMBER"] will be created
  + resource "github_actions_environment_secret" "secret" {
      + created_at      = (known after apply)
      + environment     = "prod"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-ingest-mapper"
      + secret_name     = "ACCOUNT_NUMBER"
      + updated_at      = (known after apply)
    }

  # module.ingest_mapper_environments["prod"].github_repository_environment.environment will be created
  + resource "github_repository_environment" "environment" {
      + environment = "prod"
      + id          = (known after apply)
      + repository  = "dr2-ingest-mapper"

      + reviewers {
          + teams = [
              + 7929871,
            ]
        }
    }

  # module.ingest_mapper_environments["staging"].github_actions_environment_secret.secret["ACCOUNT_NUMBER"] will be created
  + resource "github_actions_environment_secret" "secret" {
      + created_at      = (known after apply)
      + environment     = "staging"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-ingest-mapper"
      + secret_name     = "ACCOUNT_NUMBER"
      + updated_at      = (known after apply)
    }

  # module.ingest_mapper_environments["staging"].github_repository_environment.environment will be created
  + resource "github_repository_environment" "environment" {
      + environment = "staging"
      + id          = (known after apply)
      + repository  = "dr2-ingest-mapper"

      + reviewers {
          + teams = [
              + 7929871,
            ]
        }
    }

  # module.ingest_mapper_lambda.github_actions_secret.repository_secret["MANAGEMENT_ACCOUNT"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-ingest-mapper"
      + secret_name     = "MANAGEMENT_ACCOUNT"
      + updated_at      = (known after apply)
    }

  # module.ingest_mapper_lambda.github_actions_secret.repository_secret["SLACK_WEBHOOK"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-ingest-mapper"
      + secret_name     = "SLACK_WEBHOOK"
      + updated_at      = (known after apply)
    }

  # module.ingest_mapper_lambda.github_actions_secret.repository_secret["WORKFLOW_TOKEN"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-ingest-mapper"
      + secret_name     = "WORKFLOW_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_INTG_ACCOUNT_NUMBER"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_INTG_ACCOUNT_NUMBER"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_INTG_CUSTODIAN_ROLE"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_INTG_CUSTODIAN_ROLE"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_INTG_DYNAMO_TABLE"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_INTG_DYNAMO_TABLE"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_INTG_STATE_BUCKET"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_INTG_STATE_BUCKET"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_INTG_TERRAFORM_EXTERNAL_ID"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_INTG_TERRAFORM_EXTERNAL_ID"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_INTG_TERRAFORM_ROLE"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_INTG_TERRAFORM_ROLE"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_MANAGEMENT_ACCOUNT"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_MANAGEMENT_ACCOUNT"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_MGMT_ACCOUNT_NUMBER"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_MGMT_ACCOUNT_NUMBER"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_MGMT_CUSTODIAN_ROLE"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_MGMT_CUSTODIAN_ROLE"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_MGMT_DYNAMO_TABLE"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_MGMT_DYNAMO_TABLE"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_MGMT_STATE_BUCKET"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_MGMT_STATE_BUCKET"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_MGMT_TERRAFORM_EXTERNAL_ID"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_MGMT_TERRAFORM_EXTERNAL_ID"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_MGMT_TERRAFORM_ROLE"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_MGMT_TERRAFORM_ROLE"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_PROD_ACCOUNT_NUMBER"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_PROD_ACCOUNT_NUMBER"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_PROD_CUSTODIAN_ROLE"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_PROD_CUSTODIAN_ROLE"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_PROD_DYNAMO_TABLE"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_PROD_DYNAMO_TABLE"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_PROD_STATE_BUCKET"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_PROD_STATE_BUCKET"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_PROD_TERRAFORM_EXTERNAL_ID"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_PROD_TERRAFORM_EXTERNAL_ID"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_PROD_TERRAFORM_ROLE"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_PROD_TERRAFORM_ROLE"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_SLACK_WEBHOOK"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_SLACK_WEBHOOK"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_STAGING_ACCOUNT_NUMBER"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_STAGING_ACCOUNT_NUMBER"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_STAGING_CUSTODIAN_ROLE"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_STAGING_CUSTODIAN_ROLE"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_STAGING_DYNAMO_TABLE"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_STAGING_DYNAMO_TABLE"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_STAGING_STATE_BUCKET"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_STAGING_STATE_BUCKET"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_STAGING_TERRAFORM_EXTERNAL_ID"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_STAGING_TERRAFORM_EXTERNAL_ID"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_STAGING_TERRAFORM_ROLE"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_STAGING_TERRAFORM_ROLE"
      + updated_at      = (known after apply)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_WORKFLOW_PAT"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-terraform-environments"
      + secret_name     = "DR2_WORKFLOW_PAT"
      + updated_at      = (known after apply)
    }

Plan: 48 to add, 0 to change, 4 to destroy.
```